{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 9, 9], "name": "input_18", "sparse": false}, "inbound_nodes": [], "name": "input_18"}, {"class_name": "PeriodicPadding2D", "config": {"padding": [4], "dtype": "float32", "batch_input_shape": [null, 9, 9], "trainable": true, "name": "periodic_padding2d_18"}, "inbound_nodes": [[["input_18", 0, 0, {}]]], "name": "periodic_padding2d_18"}, {"class_name": "Reshape", "config": {"target_shape": [17, 17, 1], "trainable": true, "name": "reshape_36"}, "inbound_nodes": [[["periodic_padding2d_18", 0, 0, {}]]], "name": "reshape_36"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_55", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9]}, "inbound_nodes": [[["reshape_36", 0, 0, {}]]], "name": "conv2d_55"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_56", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9]}, "inbound_nodes": [[["conv2d_55", 0, 0, {}]]], "name": "conv2d_56"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_13", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_56", 0, 0, {}]]], "name": "global_average_pooling2d_13"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAAAwAAAEMAAABzEAAAAHwAAHQAAGQBABlkAgATFFMoAwAAAE5pAAAAAGkCAAAAKAEA\nAAB0CwAAAGtlcm5lbF9zaXplKAEAAAB0AQAAAHgoAAAAACgAAAAAcyAAAAA8aXB5dGhvbi1pbnB1\ndC0xMTEtYmY3ZTg4MDA3NjBkPnQIAAAAPGxhbWJkYT4PAAAAdAAAAAA=\n", null, null], "name": "lambda_12", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["global_average_pooling2d_13", 0, 0, {}]]], "name": "lambda_12"}, {"class_name": "Reshape", "config": {"target_shape": [9, 9, 1], "trainable": true, "name": "reshape_35"}, "inbound_nodes": [[["input_18", 0, 0, {}]]], "name": "reshape_35"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_26"}, "inbound_nodes": [[["lambda_12", 0, 0, {}], ["reshape_35", 0, 0, {}]]], "name": "add_26"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_57", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9]}, "inbound_nodes": [[["add_26", 0, 0, {}]]], "name": "conv2d_57"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_27"}, "inbound_nodes": [[["conv2d_57", 0, 0, {}], ["reshape_35", 0, 0, {}]]], "name": "add_27"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_58", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9]}, "inbound_nodes": [[["add_27", 0, 0, {}]]], "name": "conv2d_58"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_10", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_58", 0, 0, {}]]], "name": "flatten_10"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_10", 0, 0, {}]]], "name": "dense_10"}], "input_layers": [["input_18", 0, 0]], "output_layers": [["dense_10", 0, 0]], "name": "model_10"}, "backend": "tensorflow"}