{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 9, 9], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "PeriodicPadding2D", "config": {"padding": [4], "dtype": "float32", "batch_input_shape": [null, 9, 9], "trainable": true, "name": "periodic_padding2d_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "periodic_padding2d_1"}, {"class_name": "Reshape", "config": {"target_shape": [17, 17, 1], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["periodic_padding2d_1", 0, 0, {}]]], "name": "reshape_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9]}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "global_average_pooling2d_1"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAAAwAAAEMAAABzEAAAAHwAAHQAAGQBABlkAgATFFMoAwAAAE5pAAAAAGkCAAAAKAEA\nAAB0CwAAAGtlcm5lbF9zaXplKAEAAAB0AQAAAHgoAAAAACgAAAAAcx8AAAA8aXB5dGhvbi1pbnB1\ndC0xMy1iZjdlODgwMDc2MGQ+dAgAAAA8bGFtYmRhPg8AAAB0AAAAAA==\n", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Reshape", "config": {"target_shape": [9, 9, 1], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9]}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9]}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}